src/test/resources/requests/PushDataArrayIncorrectDateFormat.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rail="http://rail.push.ws.nicbase.com/">
   <soapenv:Header />
   <soapenv:Body>
      <rail:PushDataArray>
         <!--Zero or more repetitions:-->
         <pushData>
            <assetId>4711</assetId>
            <assetIdProvider>123456789</assetIdProvider>
            <!--Optional:-->
            <assetName>3780 4993 602-1</assetName>
            <!--Zero or more repetitions:-->
            <boxData>
               <boxId>vh47112561</boxId>
               <!--Optional:-->
               <timestamp>2016-08-20T08:11:30.411Z</timestamp>
               <!--Optional:-->
               <timeReceived>2016-08-21</timeReceived>
               <!--Optional:-->
               <moveCount>400</moveCount>
               <!--Optional:-->
               <stopCount>399</stopCount>
               <!--Optional:-->
               <moveState>DRIVING</moveState>
               <!--Optional:-->
               <movementChange>START_DRIVING</movementChange>
               <!--Optional:-->
               <voltage>12.4</voltage>
               <!--Optional:-->
               <energyConsumption>1.2</energyConsumption>
               <!--Optional:-->
               <remainingBatteryCapacity>85</remainingBatteryCapacity>
               <!--Optional:-->
               <remainingBatteryLifetime>423</remainingBatteryLifetime>
               <!--Optional:-->
               <derailed>false</derailed>
               <!--Optional:-->
               <uTurnDetected>false</uTurnDetected>
               <!--Optional:-->
               <errorCode>J23H</errorCode>
               <!--Optional:-->
               <gpsData>
                  <!--Optional:-->
                  <timestamp>2016-08-22T08:11:30.411Z</timestamp>
                  <latitude>13.123456</latitude>
                  <longitude>10.123456</longitude>
                  <!--Optional:-->
                  <height>168</height>
                  <!--Optional:-->
                  <direction>15</direction>
                  <!--Optional:-->
                  <heading>15</heading>
                  <!--Optional:-->
                  <distance>1532.17</distance>
                  <!--Optional:-->
                  <totalDistance>1532654.11</totalDistance>
                  <!--Optional:-->
                  <speed>32.5</speed>
                  <!--Optional:-->
                  <satellites>7</satellites>
                  <!--Optional:-->
                  <hdop>7</hdop>
                  <!--Optional:-->
                  <positioningDevice>GPS_GSM</positioningDevice>
               </gpsData>
               <!--Optional:-->
               <locationData>
                  <!--Optional:-->
                  <timestamp>2016-08-23T08:11:30.411Z</timestamp>
                  <!--Optional:-->
                  <street>An der Stiftsbleiche</street>
                  <!--Optional:-->
                  <streetNumber>11</streetNumber>
                  <!--Optional:-->
                  <zipCode>87439</zipCode>
                  <!--Optional:-->
                  <city>Kempten</city>
                  <!--Optional:-->
                  <country>Deutschland</country>
                  <!--Optional:-->
                  <isoCountryCode>DE</isoCountryCode>
                  <!--Optional:-->
                  <uicCountryCode>80</uicCountryCode>
               </locationData>
               <!--Zero or more repetitions:-->
               <sensorData>
                  <!--Optional:-->
                  <timestamp>2016-08-24T08:11:30.411Z</timestamp>
                  <sensorId>12345</sensorId>
                  <!--Optional:-->
                  <sensorDescription>Project Z Testsensor</sensorDescription>
                  <sensorType>TEMPERATURE</sensorType>
                  <value>14.33</value>
               </sensorData>
               <!--Optional:-->
               <loadingData>
                  <!--Optional:-->
                  <timestamp>2016-08-26T08:11:30.411Z</timestamp>
                  <!--Optional:-->
                  <loaded>true</loaded>
                  <!--Optional:-->
                  <overloaded>false</overloaded>
                  <!--Optional:-->
                  <weighing>10000</weighing>
               </loadingData>
               <!--0 to 3 repetitions:-->
               <shockData>
                  <!--Optional:-->
                  <timestamp>2016-08-27T08:11:30.411Z</timestamp>
                  <!--Optional:-->
                  <shockAxis>X</shockAxis>
                  <!--Optional:-->
                  <shockAmplitude>6.6</shockAmplitude>
                  <!--Optional:-->
                  <shockDuration>1.3</shockDuration>
                  <!--Optional:-->
                  <shocksTotal>1</shocksTotal>
                  <!--Optional:-->
                  <shockAmplitudesMax>3.1</shockAmplitudesMax>
               </shockData>
               <shockData>
                  <!--Optional:-->
                  <timestamp>2016-08-28T08:11:30.411Z</timestamp>
                  <!--Optional:-->
                  <shockAxis>Y</shockAxis>
                  <!--Optional:-->
                  <shockAmplitude>4.6</shockAmplitude>
                  <!--Optional:-->
                  <shockDuration>0.3</shockDuration>
                  <!--Optional:-->
                  <shocksTotal>5</shocksTotal>
                  <!--Optional:-->
                  <shockAmplitudesMax>2.2</shockAmplitudesMax>
               </shockData>
               <shockData>
                  <!--Optional:-->
                  <timestamp>2016-08-29T08:11:30.411Z</timestamp>
                  <!--Optional:-->
                  <shockAxis>Z</shockAxis>
                  <!--Optional:-->
                  <shockAmplitude>5.6</shockAmplitude>
                  <!--Optional:-->
                  <shockDuration>2.3</shockDuration>
                  <!--Optional:-->
                  <shocksTotal>3</shocksTotal>
                  <!--Optional:-->
                  <shockAmplitudesMax>1.2</shockAmplitudesMax>
               </shockData>
            </boxData>
         </pushData>
      </rail:PushDataArray>
   </soapenv:Body>
</soapenv:Envelope>